---
kind: type
id: T:Autodesk.Revit.DB.Structure.TrussChordLocation
source: html/d7c3f89c-c753-915f-2f14-78a2114e70c1.htm
---
# Autodesk.Revit.DB.Structure.TrussChordLocation

This enumerated type represents the options for the Truss Chord Location.

## Syntax (C#)
```csharp
public enum TrussChordLocation
```